1_Intro/index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Functional Programming for the Dysfunctional Programmer</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Functional Programming for the Dysfunctional Programmer"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-03T23:13+0100"/>
<meta name="author" content="Matthew Gilliard and Thom Leggett"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="common.css" />
<link rel="stylesheet" type="text/css" href="screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="presenter.css" media="presenter" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Functional Programming for the Dysfunctional Programmer</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Functional Programming for the Dysfunctional Programmer</a>
<ul>
<li><a href="#sec-1-1">1.1 Prelude</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Who are we?</a></li>
<li><a href="#sec-1-1-2">1.1.2 Who are you?</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 What is functional programming?</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Notes</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 An unfeasibly short introduction to clojure</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Clooj</a></li>
<li><a href="#sec-1-3-2">1.3.2 REPL?</a></li>
<li><a href="#sec-1-3-3">1.3.3 Clojure</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 org-html-slideshow incantations</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Functional Programming for the Dysfunctional Programmer &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Prelude</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Who are we? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-1-1-1">

<ul>
<li>Matthew Gilliard
<ul>
<li>Twitter: <a href="https://twitter.com/mjgilliard">@mjgilliard</a>
</li>
</ul>

</li>
<li>Thom Leggett
<ul>
<li>Twitter: <a href="https://twitter.com/thomleggett">@thomleggett</a>
</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Who are you? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>Introduce yourselves to your table.
</li>
<li>What do you know about functional programming?
</li>
<li>What languages do you use day-to-day?
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> What is functional programming? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Notes &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>Languages on post-its.
</li>
<li>Functional to dysfunctional scale.
</li>
<li>Functional definitions.
</li>
<li>Next steps.
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> An unfeasibly short introduction to clojure &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-1-3">



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Clooj &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-1-3-1">

<p>    <a href="http://j.mp/clooj-accu2013">http://j.mp/clooj-accu2013</a> or from USB stick.
</p><ul>
<li>Simple self-contained IDE for clojure.
</li>
<li>Project, file and repl.
</li>
<li>Rough edges.
</li>
</ul>

<ul>
<li id="sec-1-3-1-1">Clooj Notes &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span><br/>
<ul>
<li>Restart the REPL from REPL menu or C-r to get it working.
</li>
<li>Use projects or it won't work.
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> REPL? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-1-3-2">

<ul>
<li>Read, eval, print, loop.
</li>
</ul>





<pre class="src src-clojure">user =&gt; (<span style="color: #D8FA3C;">use</span> 'clojure.repl)
</pre>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Clojure &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h4>
<div class="outline-text-4" id="text-1-3-3">

<ul>
<li>Find intro-to-clojure directory.
</li>
<li>Open project.clj in your shiny new clooj installation.
</li>
</ul>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> org-html-slideshow incantations</h2>
<div class="outline-text-2" id="text-2">





<script type="text/javascript" src="org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-03T23:13+0100</p>
<p class="author">Author: Matthew Gilliard and Thom Leggett</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.4 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
